#!/usr/bin/env python3
# -*- codding:utf-8 -*-


# Застосуємо наші навички з програмування до деякої реальної проблеми, оскольки займатись лише абстрактними вправами
# буває сумно. В 19 столітті була запропонована нескладна міра "відносної вгодованості" тіла людини. Вона обислюєтся
# на основі тільки зросту і ваги, і називається 'Індекс Маси Тіла' (Body Mass Index = BMI). Визначається як вага
# поділена на квадрат зросту. Тут вага береться в кілограмах, а зріст в метрах. Ми не будему обговорювати наскільки
# правильна ця оцінка (звичайно вона не враховує багато факторів - стать, вік, особливості скелета) - замість цього вам
# просто треба написати програму яка запитує в користувача його зріст і вагу і виводить індекс маси тіла.


height = input('Введіть свій зріст у М: ')
weight = input('Введіть свою вагу у  Кг: ')

index = float(weight) / (float(height) ** 2)

print('Індекс маси тіла: ' + str(index))
