#!/usr/bin/env python3
# -*- codding:utf-8 -*-


# Користувача запитують про 2 невід'ємних дійсних числа a та b, причому b не дорівнює 0.
# Результат роботи програми: дійсне число - результат обчислення формули: (math.sqrt(a*b))/((e**a)*b)+(a*e**((2*a)/b))
# Дані для перевірки
# Вхідні дані: 0 1
# Результат: 0.0
# Вхідні дані: 0.5 10
# Результат: 0.688209837593


import math

numb1 = input("Введіть перше невід'ємне число: ")
numb2 = input("Введіть друге невід'ємне число: ")
e = math.e

a = float(numb1)
b = float(numb2)

x = (math.sqrt(a*b))/((e**a)*b)+(a*e**((2*a)/b))

print(x)
