#!/usr/bin/env python3
# -*- codding:utf-8 -*-


# Багато років тому була деяка війна, і підчас однієї з битв підрозділ,
# що оборонявся був оточений нападникими у печері. Щоб уникнути полону,
# вони вирішили стати в коло і вбивати кожного третього, поки не залишиться
# тільки одна людина. Він мав вчинити самогубство. Наша задача - для
# заданого числа людей N і заданого кроку K визначити номер людини, що
# залишається останньою в цьому процесі. Наприклад для 10 людей і якщо
# вибуває кожний 3-й, то залишається той хто стояв четвертим в початковій
# позиції. Нумерація людей починається з одиниці.


import itertools

def joseph_flav(number: int, step: int) -> int:
	"""kills every third person """
	
    lst = list(range(1, number + 1))
    count = 0
    while len(lst) > 1:
        first = lst.pop(0)
        if count % 3:
            lst.append(first)
            count = 0
        else: count += 1
    return lst

print(joseph_flav(10, 3))