#!/usr/bin/env python3
# -*-codding:utf-8 -*-


# Завдання написати просту програмку, що конвертує текстовий рядок у послідовність сигналів азбуки Морзе. Тест-кейс
# 'SOS' -> '... --- ...'


def to_morse(text: str) -> str:
    """ Translate your sentence into Morse code"""

    morse_val = {'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.', 'g': '--.', 'h': '....',\
                 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.', 'o': '---', 'p': '.--.',\
                 'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-',\
                 'y': '-.--', 'z': '--..', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',\
                 '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----'}
    morse_code = [morse_val[_] for _ in ''.join(text.lower().split())]
    return ' '.join(morse_code)


print(to_morse(input("Input your sentence (in English): ")))
