#!/usr/bin/env python3
# -*- codding:utf-8 -*-


# Ця вправа настільки популярна, що ви можете знайти її в багатьох книгах та онлайн-курсах з програмування (зокрема в
# класичній книзі Кернігана і Рітчі з мови Сі).
# У Європі температуру частіше вимірюють в градусах Цельсія, а в США - за Фаренгейтом. Обидві ці шкали рівномірні, проте
# за Цельсієм вода замерзає при 0 и кипить при 100, а за Фаренгейтом при 32 і 212 відповідно. Вам пропонується
# використати ці дві точки для перетворення решти значень.
# Напишить програму, яка перетворює значення за шкалою Фаренгейта в значення за шкалою Цельсія.


temperature_far = input('Введіть градуси фаренгейта: ')

celsius = (int(temperature_far)-32)/1.8

print('Градуси цельсія: ' + str(celsius))
